In [11]:
person_mentions_df = entity_mentions_df[
    entity_mentions_df["type"] == "Person"]
person_mentions_df.tail(4)

      type              text                              span  confidence
37  Person  Daniel Hernandez  [1288, 1304): 'Daniel Hernandez'    0.994301
39  Person       Curren Katz       [1838, 1849): 'Curren Katz'    0.990223
43  Person        Ritu Jyoti        [2476, 2486): 'Ritu Jyoti'    0.713109
52  Person       Tyler Allen       [4213, 4224): 'Tyler Allen'    0.964611